Repository: Slipfaith/tmragger
Catalog: sample-tmx/HW_Marketing_en-US_pt-PT_repaired.tmx
Source language: en_us
Languages: pt_pt

source: Iyari’s Event To celebrate the arrival of a new Titan, the Dominion is holding themed quests.
pt_pt: Evento de Iyari Para celebrar a chegada de um novo Titã, o Domínio vai realizar missões temáticas.

source: Complete them to earn coins that you can use in the special shop to buy and upgrade Iyari.
pt_pt: Conclui-as para ganhar moedas que podes usar na loja especial para comprar e melhorar a Iyari.

source: Shine the light of your heroic feats on the Dominion!
pt_pt: Ilumina as tuas proezas heroicas no Domínio!

source: We're sorry to hear that you didn't enjoy our game.
pt_pt: Lamentamos saber que não gostaste do nosso jogo.

source: We'll do our best to improve it!
pt_pt: Vamos dar o nosso melhor para melhorá-lo!

source: Our developers will continue working on the game, and we hope you enjoy our future updates!
pt_pt: Os nossos criadores vão continuar a trabalhar no jogo e esperamos que gostes das futuras atualizações!

source: Jump on this chance to join the Way of Mystery heroes’ special event, upgrade Amira, and get many useful rewards!
pt_pt: Junta-te ao evento especial dos heróis do Caminho do Mistério, melhora Amira e obtém muitas recompensas úteis!

source: Leprecats Are Celebrating!
pt_pt: Os Gnomolinos estão em festa!

source: Get Soul Stones for Dorian for daily logins in October!
pt_pt: Obtém pedras anímicas para Dorian nos inícios de sessão diários de outubro!

source: Power up your Heroes & get a Skin+ for Alvanor!
pt_pt: Melhora heróis e obtém um Visual+ para Alvanor!

source: US Dollar
pt_pt: Dólar americano

source: Philippine Peso
pt_pt: Peso filipino

source: Hero Wars: Fantasy Battles
pt_pt: Hero Wars: Lutas de Fantasia

source: Please try again in a minute.
pt_pt: Tenta novamente num minuto.

source: Your request is still being processed.
pt_pt: O teu pedido ainda está a ser processado.

source: You are a Hero!
pt_pt: Sê um herói!

source: From May 13th, embark on a search for Dominion’s mysteries with Lara Croft!
pt_pt: A partir de 13 de maio, procura os mistérios do Domínio com a Lara Croft!

source: Hearts of Dominion
pt_pt: Corações do Domínio

source: Test your brains as well as your brawn with in-game puzzles and minigames.
pt_pt: Testa a tua força e astúcia com os enigmas e minijogos do jogo.

source: A tidal wave has crashed down over the Dominion!
pt_pt: Uma onda gigante abateu-se sobre o Domínio!

source: Make your Guardians stronger with new Skins to brave the elements!
pt_pt: Melhora os teus Guardiões com novos visuais e enfrenta os elementos!

source: Please update the game to the latest version :) Follow this link to do so: bit.ly/Stores_IQ
pt_pt: Atualiza o jogo para a versão mais recente :) Clica neste link para atualizares: bit.ly/Stores_IQ

source: Play free
pt_pt: Jogar gratuitamente

source: Join a Guild event and challenge the Archdemon!
pt_pt: Entra no evento da Guilda, desafia o Grão-Demónio!

source: Join the exciting adventure of a spooky season!
pt_pt: Aventura-te nesta temporada assustadora!

source: Don’t miss the birth of the mightiest Dark Titan!
pt_pt: Não percas a chegada da poderosa Titã das Trevas!

source: No user matching this email address was found.
pt_pt: Não foi encontrado nenhum utilizador que corresponda a este endereço de e-mail.

source: Please verify the email address, create an account, or contact our Support.
pt_pt: Verifica o endereço de e-mail, cria uma conta ou contacta o Suporte.

source: Kai is a mage extraordinaire and a true genius.
pt_pt: Kai é um mago extraordinário e um verdadeiro génio.

source: Spurned by his neighbors at home, he was forced to look for a new place to settle down in, and he decided on Dominion.
pt_pt: Rejeitado pelos seus vizinhos, foi obrigado a encontrar um novo lugar: o Domínio.

source: Now it's time to help Kai become even stronger.
pt_pt: Agora está na altura de ajudar Kai a tornar-se ainda mais poderoso.

source: Claim daily rewards and watch his powers grow!
pt_pt: Resgata recompensas diárias e vê os seus poderes a aumentar!

source: Your e-mail is not confirmed yet
pt_pt: Ainda não confirmaste o teu e-mail

source: Lunar Skin Sale in the Dominion!
pt_pt: Visuais lunares no domínio!

source: Please, install Google Chrome for Linux.
pt_pt: Instala o Google Chrome para Linux.

source: This Month's Hero is Xe'Sha!
pt_pt: A heroína do mês é Xe'Sha!

source: All done!
pt_pt: Feito!

source: We won’t send you emails from now on.
pt_pt: A partir de agora não te enviaremos e-mails.

source: If you’ll change your mind, you can always subscribe back in your account settings.
pt_pt: Caso mudes de ideias, podes sempre voltar a subscrever nas definições da tua conta.

source: Take part in seasonal events and complete all levels of the pass!
pt_pt: Participa em eventos sazonais e conclui o passe!

source: Reach Xe’Sha’s Sea Skin and other Grand Prizes!
pt_pt: Obtém um visual marítimo para Xe’Sha e outros prémios fantásticos!

source: Time for the Dominion to bloom!
pt_pt: É agora que o Domínio floresce!

source: Get a new Spring Skin and enjoy new offers to power up your Heroes and Titans!
pt_pt: Obtém um Visual de Primavera e desfruta de ofertas para reforçar os teus Heróis e Titãs!

source: Don’t miss out on the Full Moon Sale, with discounts on multiple items to power up your Heroes!
pt_pt: Não percas a Promoção da Lua Cheia, com montes de descontos em itens para os teus heróis!

source: A big wave of releases! New Hero Cascade the Titan joins the pool of the Dominion’s Guardians! He can smash through any armor with his powerful torrents. Wrath of the Elements Help the new hero master his power and earn rewards! New Heroic Chest Summoning and upgrading heroes is now much easier! You can get Skins+ and select the factions you like best, so hurry to the main square to stock up on chests! New Battle Interface The same functions now come with a shiny new look! Battle in style!
pt_pt: Uma chuva de novidades! Novo Herói O novo Titã, Cascade, junta-se aos Guardiões do Domínio! As suas poderosas torrentes destroem qualquer armadura. A Fúria dos Elementos Ajuda o novo herói a dominar o seu poder e ganha recompensas! Novo Baú Heroico Agora é mais fácil invocar e melhorar heróis! Obtém visuais+ e escolhe as tuas fações favoritas. Dá um salto à praça principal e adquire os baús! Nova Interface de Batalha As mesmas funcionalidades,num pacote mais elegante! Combate com estilo!

source: • The traveling Mouse Merchant brought some interesting wares.
pt_pt: • O Comerciante de Ratos Ambulante trouxe mercadorias interessantes.

source: There's never a dull moment in Hero Wars, don't miss out on the fun!
pt_pt: Nunca há momentos chatos em Hero Wars! Não percas a diversão!

source: - Hordes of the Undead threaten the Dominion!
pt_pt: - O Domínio está a ser ameaçado por hordas de mortos-vivos!

source: Drive them away and save Easter!
pt_pt: Livra-te deles e salva a Páscoa!

source: Remember to grab your reward!
pt_pt: Não te esqueças de recolher a tua recompensa!

source: Fan Content Policy: https://nextersglobal.com/fan_content_hw
pt_pt: Política de conteúdos de fãs: https://nextersglobal.com/fan_content_hw

source: Terms of Service
pt_pt: Termos de Serviço

source: We’ll be sure to pass it onto the dev team for possible consideration :)
pt_pt: Vamos passá-los à equipa de desenvolvimento que vão tomá-los em consideração :)

source: Skill Booster: Take the Best of Your Heroes Even in the Hardest of Battles
pt_pt: Reforço de habilidade: mostra o melhor dos teus heróis até nos combates mais desafiantes

source: Yo-ho-ho, welcome to the land of pirates!
pt_pt: Yo ho ho, estás na terra dos piratas!

source: Open Chests, seize precious treasures, and get all the goods you need!
pt_pt: Abre baús, descobre tesouros e obtém tudo o que precisas!

source: Alliance of Forces
pt_pt: Uma Aliança de Forças

source: Hurry up to dive into the tropical paradise full of exciting quests, attractive offers, and various rewards!
pt_pt: Mergulha já neste paraíso tropical cheio de emocionantes missões, ofertas incríveis e várias recompensas!

source: Hurry up, Heroes!
pt_pt: Rápido!

source: The merchant is unusually generous this week!
pt_pt: O comerciante está a sentir-se generoso esta semana!

source: Here's your chance to get lots of various items for your Heroes and Titans and power up your teams!
pt_pt: Aproveita a oportunidade para obter itens tanto para heróis como para titãs e melhorar as tuas equipas!

source: Start the fall with a round of exciting events!
pt_pt: Entra no outono com alguns eventos fantásticos!

source: The Dominion enters its prime!
pt_pt: O Domínio chega ao seu auge!

source: The latest events are your chance to unlock your Heroes' full potential!
pt_pt: Os últimos eventos são a tua oportunidade de desbloquear o potencial dos teus Heróis!

source: Talisman Keepers Use Talismans to increase Dante, Jet, Jhu, Dorian, Cornelius, and Satori's stats, and unleash their full might on your enemies!
pt_pt: Vigias do Talismã Usa Talismãs para melhorar os atributos de Dante, Jet, Jhu, Dorian, Cornelius, e Satori para libertar todo o seu poder nos teus inimigos!

source: Titan Brawls With the Titans more powerful than ever, their battles are bound to be explosive!
pt_pt: Brigas de Titãs As batalhas dos Titãs estão mais poderosas do que nunca.

source: Help Mort assemble his dream team and crush his enemies to earn awesome rewards.
pt_pt: Ajuda Mort a criar a sua equipa de sonho e esmaga os seus inimigos para ganhar recompensas incríveis.

source: Show your prowess and give people something to talk about!
pt_pt: Mostra o que vales!

source: Iris, Astrid, and Heidi are trying on cute onesies for the April Masquerade. Don't be fooled by their charm, though! They're still just as ready to pounce at their enemies and go wild on the battlefield! Seize your chance to get these Masquerade Skins for your collection at a good price! Check out the event shop for all kinds of great offers, including an upgrade for Astrid's skin.
pt_pt: A Iris, a Astrid e a Heidi estão a experimentar macacões giros para o Baile de Máscaras de abril. Mas não te deixes enganar pelo seu encanto! Continuam prontas para o campo de batalha! Aproveita a oportunidade de conseguir estes Visuais Mascarados para a tua coleção a um bom preço! Espreita a loja do evento para mais promoções incríveis, incluindo uma melhoria para o visual de Astrid.

source: - Take part in our charming special event and get Daredevil Soul Stones, new avatars, and discounts!
pt_pt: - Participa no nosso maravilhoso evento especial e obtém Pedras da Alma da Daredevil, novos avatares e descontos!

source: A new sun rises over the Dominion!
pt_pt: Há um novo sol no Domínio!

source: Solaris The new Super Titan, Solaris, shines so bright her light can incinerate any foes and give warmth to any allies!
pt_pt: Solaris A luz de Solaris, a nova Supertitã, é tão intensa que incinera inimigos tão facilmente como aquece aliados!

source: You can test the newest warrior in your the lineup during the special event.
pt_pt: Podes testar esta nova guerreira durante o evento especial.

source: Sign her up for Brawls with the other Titans and help her unleash her full might!
pt_pt: Participa em combates com outros Titãs para descobrires o verdadeiro potencial dela!

source: Winter in the Dominion Spend the winter holidays with your favorite Heroes, and don't forget to spread Winterfest cheer with their cozy new outfits!
pt_pt: O inverno chegou ao Domínio Passa a época com os teus heróis favoritos e não te esqueças de espalhar a alegria e magia do Festival de Inverno com os novos trajes!

source: Free EXP Potions!
pt_pt: Poções de EXP grátis!

source: Click the image to get 20 Huge EXP Potions!
pt_pt: Clica na imagem para obter 20 Poções de EXP Imensas!

source: Hungarian Forint
pt_pt: Florim húngaro

source: The winter brings new challenges and new skins!
pt_pt: O inverno traz novos desafios e novas visuais!

source: Take part in the brand new event for the entire Way of Mystery: strengthen Heroes of this Faction and their Artifacts!
pt_pt: Participa no novo evento do Caminho do Mistério: fortalece os heróis desta fação e os seus artefactos!

source: Get the Isaac Spring Skin & valuable upgrade resources to prove victorious!
pt_pt: Obtém o Visual Primaveril para Isaac, valiosos recursos de melhoria e triunfa!

source: St. Patrick’s Day, a power-up for Judge, and UI adjustments!
pt_pt: Dia de São Patrício, reforço do Judge e ajustes na IU!

source: St. Patrick’s Day Event Leprecats, the Bundle Wheel, and the Emerald Sale are back!
pt_pt: Evento de São Patrício Voltaram os Gnomolinos, a Roda de Conjuntos e a Promoção de Esmeraldas!

source: Judge We heard you asking — now the hero strikes his enemies with even more lightning bolts!
pt_pt: Judge Bem vos ouvimos - agora ele acerta nos inimigos com ainda mais raios!

source: Skin Tab Skin stats can now be found in a separate tab where you can easily see how they add up.
pt_pt: Separador de Visuais Vê num instante as estatísticas de visuais num separador diferente.

source: Store Improvements Enjoy a new set of product icons and item counters.
pt_pt: Melhorias da Loja Espreita os novos ícones e contadores de itens.

source: In addition, the first stock refreshment is now free!
pt_pt: Para além disso, a primeira atualização de stock passa a ser grátis!

source: Best of luck, Brave Hero!
pt_pt: Que a sorte te acompanhe, Bravo Herói!

source: By signing up, you agree to our <span class="doclink" data-link="terms">Terms of Service</span> and <span class="doclink" data-link="policy">Privacy and Cookie Policy</span>.
pt_pt: Ao efetuares o registo, concordas com os nossos <span class="doclink" data-link="terms">Termos de Serviço</span> e com a nossa <span class="doclink" data-link="policy">Política de Privacidade e Cookies</span>.

source: ALMOST THERE!
pt_pt: ESTÁ QUASE!

source: Halloween is here!
pt_pt: O Dia das Bruxas chegou!

source: Get ready for an exciting journey full of battles, daily activities and a new hero - Xe'Sha!
pt_pt: Embarca numa entusiasmante viagem, com batalhas, atividades diárias e a nova heroína: Xe'Sha!

source: Danish Krone
pt_pt: Coroa dinamarquesa

source: Do you want to become a hero?
pt_pt: Queres tornar-te um herói?

source: Help defend the Dominion against its evil foes.
pt_pt: Ajuda a defender o Domínio dos vilões.

source: 8-30 alphanumeric characters
pt_pt: 8 a 30 caracteres alfanuméricos

source: And remember! – We are always here for you via support@herowars.zendesk.com, Your Hero Wars Team.
pt_pt: E lembra-te! Estamos sempre aqui para ajudar-te, em support@herowars.zendesk.com. A tua equipa de Hero Wars.

source: Oya’s Solar Skin and blindingly good deals at the event shop!
pt_pt: Visual Solar para Oya e grandes promoções na loja do evento!

source: Unfortunately, there's no sync between this version and Facebook as they differ quite a lot and develop separately.
pt_pt: Infelizmente não existe funcionalidade de sincronização entre esta versão e o Facebook, porque são muito diferentes e foram desenvolvidos de forma separada.

source: Hi! We're sorry that you feel this way :( Make sure you use all possible ways to get more energy! Like burning fruits in the cauldron, opening amphoras on the Island, completing boat orders, and many more! Also, thank you for your feedback as it helps us improve the game!
pt_pt: Olá! Lamentamos que te sintas assim :( Tenta usar todas as formas possíveis de ganhar mais energia! Podes cozinhar frutas no caldeirão, abrir ânforas na Ilha, concluir ordens de barco e muito mais! Obrigado pelos comentários. Ajudam-nos a melhorar o jogo!

source: Unique rewards and a cool Mushy and Shroom skin!
pt_pt: Recompensas únicas e um visual para Mushy e Shroom

source: Take part in the special Black Friday event, full of great offers and resources!
pt_pt: Participa no evento Black Friday de Halloween, cheio de ofertas e recursos!

source: We are happy to welcome you in the Dominion!
pt_pt: Estamos felizes por te receber no Dominion!

source: Join the magical Winterfest fun!
pt_pt: Junta-te à diversão do Festival de Inverno!

source: Sometimes Emily's path can be blocked by a building or a patch.
pt_pt: Por vezes o caminho da Emily poderá estar obstruído por um edifício ou outro objeto.

source: Try moving such an object to a different place and see if it works.
pt_pt: Tenta mover esse objeto para outro sítio.

source: If the issue persists, please reach out to the Support via the game settings Thank you!
pt_pt: Se o problema persistir, contacta-nos através do Suporte nas definições de jogo Obrigado!

source: Guardian's Awakening!
pt_pt: O Despertar da Guardiã!

source: Spring is Back in Style!
pt_pt: A Primavera Voltou em Estilo!

source: A romantic event with new Hero Skins and special offers is starting!
pt_pt: Um evento romântico com novos Visuais de Herói e ofertas especiais!

source: Hero Wars is compatible with the following devices: iPhone SE, 6S, 7, 8, X, XS, XR, 11; iPad Mini 4, Air 2, 2017, 2018, Pro.
pt_pt: O Hero Wars é compatível com os seguintes dispositivos: iPhone SE, 6S, 7, 8, X, XS, XR, 11; iPad Mini 4, Air 2, 2017, 2018, Pro.

source: Saved
pt_pt: Guardado

source: Show off your tactical mastery: assemble the best hero teams, defeat your opponents, and become a legend of drafting!
pt_pt: Mostra a tua genialidade tática: cria as melhores equipas de Heróis, derrota os adversários e transforma-te numa lenda!

source: Freedom for Leprecats
pt_pt: Liberdade para os gnomolinos

source: ● Epic Guild battles
pt_pt: ● Épicas batalhas de guilda

source: Hero Wars is all about legends, choose your path and write your own story!
pt_pt: Hero Wars é sobre criar lendas. Escreve a tua própria história!

source: New Hero, New Adventure
pt_pt: Novo Herói, nova aventura

source: Follow the way of a true Hero with the new monthly Battle Pass!
pt_pt: Siga o caminho de um verdadeiro herói com o novo Battle Pass mensal!

source: As the seasons change, so does our game!
pt_pt: A estação muda ao ritmo do nosso jogo!

source: Mojo Update Our wise shaman is now better at spellcasting and has better chemistry with his Nature allies.
pt_pt: Atualização Mojo O xamã é agora melhor nos feitiços e tem mais química com os aliados da natureza.

source: To top it off, Mojo got a visual revamp - check it out!
pt_pt: Mas não é tudo, o visual do Mojo foi renovado!

source: Mojo Brawls Assemble a strong team with the newly-buffed hero, challenge his new powers, and earn rewards!
pt_pt: Brigas do Mojo Cria uma equipa poderosa com este herói reforçado, desafia os seus poderes e ganha recompensas!

source: The Fall Festival The Dominion has waited too long - it's time to enjoy festivities once more!
pt_pt: Festival de Outono O Domínio esperou tempo demais: é hora de celebrar!

source: Pour yourself a cup of Harunian brew and join in the fun!
pt_pt: Prepara uma bebida de Harun e toca a celebrar!

source: Start the fall on a bright note!
pt_pt: Começa o outono em grande estilo!

source: Upgrade the Nature Warrior this January!
pt_pt: Melhora o Guerreiro da Natureza neste janeiro!

source: Be the first to know about special events, get presents and tips!
pt_pt: Sê o primeiro a ficar a par de eventos especiais, receber presentes e dicas!

source: – Follow us on social media!
pt_pt: Segue-nos nas redes sociais!

source: Can not do this, you have one way to enter the game
pt_pt: Não é possível fazer isto, visto que esta é a única forma de entrar no jogo

source: HELP THE EXECUTIONER
pt_pt: AJUDAR O CARRASCO

source: Hello there, adventurer!
pt_pt: Olá, fã de aventuras!

source: Here you need to find two pairs of books with the same symbols.
pt_pt: Aqui, tens de encontrar dois pares de livros com símbolos iguais.

source: Just a hint: you can close books by tapping on them
pt_pt: Uma dica: toca nos livros para os fechar

source: The festivities continue!
pt_pt: As festas continuam!

source: Refresh the look of Mushy & Shroom, Morrigan, and Corvus to improve their battle abilities!
pt_pt: Dá um novo ar a Mushy e Shroom, Morrigan e Corvus para melhorar as suas habilidades de combate!

source: Good luck in your battles, brave hero! And remember – we’re always here to help at support@herowars.zendesk.com
pt_pt: Boa sorte nas batalhas, bravo herói, e lembra-te: estamos sempre aqui para te ajudar, através do support@herowars.zendesk.com.

source: Good luck, Brave Hero, and remember: we are always here for you: support@herowars.zendesk.com.
pt_pt: Boa sorte, Bravo Herói, e lembra-te! Estamos sempre aqui para ajudar-te, em support@herowars.zendesk.com.

source: Illuminate the world with the new Super Titan!
pt_pt: Ilumina o mundo com a nova Supertitã!

source: Hey, you should totally check out our Discord server again.
pt_pt: Olá, recomendamos mesmo que espreites o nosso servidor no Discord.

source: And leave some messages there to be invited to a secret channel with news about upcoming events!
pt_pt: Se escreveres algumas mensagens por lá, podes vir a ser convidado para um canal secreto cheio de novidades sobre eventos!

source: What a lively update! A New Guardian Folio is quite the unusual hero, being a living tome! He’s incredibly inquisitive, and every bit as strong as other heroes! Add him to your team and unleash the power of hidden knowledge on your enemies! Draft Tavern The legendary tavern opens its doors once more! Don’t miss the chance to let loose and show off: battle against other players in real time, earn valuable prizes, and become a draft legend! Knowledge is the key to victory!
pt_pt: Que grande atualização! Um Novo Guardião Folio é um Herói incomum. Afinal, é um livro! Tem uma curiosidade sem limites, mas é tão forte como os outros heróis! Adiciona-o à tua equipa e usa o poder do conhecimento contra os teus inimigos! Taberna de Recrutamento As portas da lendária taverna já abriram! Mostra o que vales! Enfrenta outros jogadores em tempo real e ganha prémios valiosos! Vais ser uma lenda! O conhecimento é a chave da vitória!

source: Welcome back Solaris's glorious radiance!
pt_pt: Boas-vindas ao glorioso brilho de Solaris!

source: Captains and Heroes fight to the top together.
pt_pt: Capitães e heróis tentam atingir o pódio!

source: Assemble the best crew, beat the opposition, and claim all the rewards!
pt_pt: Cria a melhor equipa, derrota os adversários e ganha as recompensas!

source: Valentine's Day in Dominion Irresistible Heroes Chabba, Octavia, and Ziri are getting new Romantic Skins that will turn everyone's heads!
pt_pt: Dia dos Namorados no Domínio Heróis Irresistíveis Chabba, Octavia e Ziri ganham novos visuais românticos que não vão deixar ninguém indiferente!

source: Chabba's skin can be upgraded further during the event.
pt_pt: Podes melhorar ainda mais o visual de Chabba durante o evento.

source: Hearts of Dominion Start a new romantic Adventure if you want to obtain the special Gift of Love chest!
pt_pt: Corações do Domínio Parte numa aventura romântica e obtém o baú especial Presente de Amor!

source: Go on exciting Expeditions, spend energy, and open chests to earn Love Coins for the Flower Shop.
pt_pt: Participa em Expedições, gasta energia e abre baús para ganhar Moedas do Amor que podes gastar na Loja de Flores.

source: Love always prevails!
pt_pt: O amor vence sempre!

source: Hey!
pt_pt: Ei!

source: Here you need to explore every corner of the ship to find figurines.
pt_pt: Aqui tens de explorar todos os recantos do navio para encontrar figuras.

source: Keep in mind that one of the figurines is hidden outside the deck.
pt_pt: Não te esqueças de que uma das figuras está escondida fora do convés.
